In [2]:
import pandas as pd 
import numpy as np

In [4]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': [
        'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South'
    ],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': [
        'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice'
    ]
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)

In [5]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    466     95   John  January      Q1
1  2023-01-02       B   West    191     44   Mary  January      Q1
2  2023-01-03       C  North    280     64    Bob  January      Q1
3  2023-01-04       D  South    231     19  Alice  January      Q1
4  2023-01-05       A   East    298     30   John  January      Q1
5  2023-01-06       B   West    935     30   Mary  January      Q1
6  2023-01-07       C  North    890     91    Bob  January      Q1
7  2023-01-08       D  South    857     72  Alice  January      Q1
8  2023-01-09       A   East    385     11   John  January      Q1
9  2023-01-10       B   West    861     30   Mary  January      Q1
10 2023-01-11       C  North    255     13    Bob  January      Q1
11 2023-01-12       D  South    291     36  Alice  January      Q1
12 2023-01-13       A   East    533     63   John  January      Q1
13 2023-01-14       B   West    577     82   Mary  January      Q1
14 2023-01-15       C  North    973     44    Bob  January      Q1
15 2023-01-16       D  South    799     39  Alice  January      Q1
16 2023-01-17       A   East    566     94   John  January      Q1
17 2023-01-18       B   West    185     34   Mary  January      Q1
18 2023-01-19       C  North    811     54    Bob  January      Q1
19 2023-01-20       D  South    978     59  Alice  January      Q1

In [8]:
pd.pivot_table(df,values="Sales",index="Region",columns="Product")

Product      A      B      C      D
Region
East     449.6    NaN    NaN    NaN
North      NaN    NaN  641.8    NaN
South      NaN    NaN    NaN  631.2
West       NaN  549.8    NaN    NaN

In [10]:
pd.pivot_table(df,values=["Sales","Units"],index="Region",columns="Product")

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     449.6    NaN    NaN    NaN  58.6   NaN   NaN   NaN
North      NaN    NaN  641.8    NaN   NaN   NaN  53.2   NaN
South      NaN    NaN    NaN  631.2   NaN   NaN   NaN  45.0
West       NaN  549.8    NaN    NaN   NaN  44.0   NaN   NaN

In [12]:
pd.crosstab(df["Region"],df["Product"])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0